#!/bin/bash
#set -x
#===========================================================
# sedコマンド学習用シェルスクリプト
# ファイル自動置換シェルスクリプト
#===========================================================

#=====概　要================================================
#基本的には指定されたファイルを第二引数で指定された文字列を
#を探しだし、第３引数に指定された文字列に置換を行う。
#置換された文字列は、"指定されたファイル名_after"といった形
#でカレントディレクトリに出力される。
#===========================================================

#===========================================================
# 変数及び定数
#===========================================================
#第一引数、第二引数用途
file_name=$1		#置換ファイル名指定
Substi_befoar=$2	#置換対象文字列
Substi_after=$3		#置き換え文字列

#変数
cnt_word=0
tmp_word=""		#指定されたファイル出力結果一時格納用変数
file_name_after="${file_name}_after"	#置換後出力されたファイル名格納用変数


#===========================================================
# 開始処理
#===========================================================
if test "${file_name}" = "" ; then 
	echo "引数が指定されていません。"
	exit 1 
elif test -d "${file_name}" ; then
	echo "指定されているファイルがありません。"
	exit 1
fi

cnt_word=$(cat ${file_name} | grep ${Substi_befoar} | wc -l)

echo "${cnt_word}"

if test ${cnt_word} -eq 0 ; then
	echo "置換対象の文字列は存在しないようです。"
	exit 0
fi

echo 'sedコマンドテストスクリプト開始します。'

#=========================================================i=
# メイン処理
#===========================================================

sed "s/${Substi_befoar}/${Substi_after}/g" ${file_name} > ${file_name_after} 

echo "置換処理完了し、${file_name_after}を作成しました。"

exit 0

